# Dotfiles Brewfile
# Install with: brew bundle

# Core tools
brew "zsh"
brew "starship"
brew "neovim"
brew "git"
brew "gh"

# Python tooling
brew "uv"        # Modern Python package manager (replaces pip/pipenv)

# Zsh plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Navigation and search
brew "fzf"
brew "direnv"
brew "zoxide"  # Modern alternative to autojump

# Modern CLI tools
brew "bat"       # Better cat
brew "fd"        # Better find
brew "ripgrep"   # Better grep
brew "tree"      # Directory tree
brew "jq"        # JSON processor
brew "yq"        # YAML processor
brew "wget"      # Download tool
brew "htop"      # System monitor

# Development tools
brew "tmux"      # Terminal multiplexer
brew "ffmpeg"    # Media processing

# AWS & Cloud tools
brew "aws-vault" # AWS credential management
brew "awscli"    # AWS CLI

# Security & Authentication
brew "keyring"        # Credential storage
brew "1password-cli"  # 1Password CLI

# Applications (casks)
cask "alfred"      # Productivity launcher
cask "arc"         # Web browser
cask "flameshot"   # Screenshot tool
cask "obsidian"    # Knowledge management
cask "rectangle"   # Window management
cask "requestly"   # HTTP interceptor
cask "signal"      # Secure messaging
